Ran Plan for 5 projects:

1. dir: `terraform/ecr` workspace: `default`
1. dir: `terraform/ecs-service` workspace: `default`
1. dir: `terraform/elasticache-redis` workspace: `default`
1. dir: `terraform/github-oidc` workspace: `default`
1. dir: `terraform/sqs-queue` workspace: `default`
---

### 1. dir: `terraform/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_region.current: Read complete after 0s [id=ap-northeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.crawlinghub will be created
+ resource "aws_ecr_lifecycle_policy" "crawlinghub" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "최근 10개 이미지만 유지"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "prod-",
                              + "release-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "태그 없는 이미지 7일 후 삭제"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-prod"
    }

  # aws_ecr_repository.crawlinghub will be created
+ resource "aws_ecr_repository" "crawlinghub" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "crawlinghub-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ecr/crawlinghub"
          + "Name"        = "ecr-crawlinghub-prod"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ecr/crawlinghub"
          + "Name"        = "ecr-crawlinghub-prod"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.crawlinghub_github_actions will be created
+ resource "aws_ecr_repository_policy" "crawlinghub_github_actions" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:role/GitHubActionsRole"
                        }
                      + Sid       = "AllowGitHubActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "crawlinghub-prod"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ registry_id     = (known after apply)
+ repository_arn  = (known after apply)
+ repository_name = "crawlinghub-prod"
+ repository_url  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/ecr
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/ecr
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terraform/ecs-service` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.sqs_queue_url: Reading...
data.aws_ssm_parameter.db_instance_address: Reading...
data.aws_ecr_repository.crawlinghub: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.redis_endpoint: Reading...
data.aws_ssm_parameter.db_instance_port: Reading...
data.aws_kms_key.ecs_secrets: Reading...
data.aws_ssm_parameter.redis_port: Reading...
data.aws_ssm_parameter.sqs_queue_arn: Reading...
data.aws_kms_key.cloudwatch_logs: Reading...
data.aws_kms_key.cloudwatch_logs: Read complete after 0s [id=46ee44d3-866f-4029-b456-338f482eb1cb]
data.aws_kms_key.ecs_secrets: Read complete after 0s [id=6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a]
data.aws_ssm_parameter.public_subnet_ids: Reading...
data.aws_ssm_parameter.crawlinghub_user_password_secret_name: Reading...
data.aws_ssm_parameter.db_instance_address: Read complete after 0s [id=/shared/rds/db-instance-address]
data.aws_ssm_parameter.db_instance_port: Read complete after 0s [id=/shared/rds/db-instance-port]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.redis_port: Read complete after 0s [id=/crawlinghub/prod/redis/port]
data.aws_ssm_parameter.redis_endpoint: Read complete after 0s [id=/crawlinghub/prod/redis/endpoint]
data.aws_ssm_parameter.sqs_queue_url: Read complete after 0s [id=/crawlinghub/prod/sqs/schedule-trigger-queue-url]
data.aws_ssm_parameter.sqs_queue_arn: Read complete after 0s [id=/crawlinghub/prod/sqs/schedule-trigger-queue-arn]
data.aws_ssm_parameter.private_subnet_ids: Reading...
data.aws_ssm_parameter.crawlinghub_user_password_secret_name: Read complete after 0s [id=/crawlinghub/prod/db-user-password-secret-name]
data.aws_ssm_parameter.private_subnet_ids: Read complete after 0s [id=/shared/network/private-subnet-ids]
data.aws_ssm_parameter.public_subnet_ids: Read complete after 0s [id=/shared/network/public-subnet-ids]
data.aws_ecr_repository.crawlinghub: Read complete after 0s [id=crawlinghub-prod]
data.aws_secretsmanager_secret_version.crawlinghub_user_password: Reading...
data.aws_secretsmanager_secret_version.crawlinghub_user_password: Read complete after 0s [id=prod-crawlinghub-db-password|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_cluster.crawlinghub will be created
+ resource "aws_ecs_cluster" "crawlinghub" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "crawlinghub-prod-cluster"
      + tags     = {
          + "Component"   = "ecs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-cluster"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all = {
          + "Component"   = "ecs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-cluster"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.crawlinghub will be created
+ resource "aws_ecs_cluster_capacity_providers" "crawlinghub" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "crawlinghub-prod-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # aws_iam_role.crawlinghub_execution_role will be created
+ resource "aws_iam_role" "crawlinghub_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-prod-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.crawlinghub_task_role will be created
+ resource "aws_iam_role" "crawlinghub_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-prod-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.crawlinghub_ecr_policy will be created
+ resource "aws_iam_role_policy" "crawlinghub_ecr_policy" {
      + id          = (known after apply)
      + name        = "crawlinghub-prod-ecr-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.crawlinghub_logs_policy will be created
+ resource "aws_iam_role_policy" "crawlinghub_logs_policy" {
      + id          = (known after apply)
      + name        = "crawlinghub-prod-logs-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.crawlinghub_secrets_access will be created
+ resource "aws_iam_role_policy" "crawlinghub_secrets_access" {
      + id          = (known after apply)
      + name        = "crawlinghub-prod-secrets-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:prod-shared-mysql-master-password-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.crawlinghub_sqs_access will be created
+ resource "aws_iam_role_policy" "crawlinghub_sqs_access" {
      + id          = (known after apply)
      + name        = "crawlinghub-prod-sqs-access"
      + name_prefix = (known after apply)
      + policy      = (sensitive value)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.crawlinghub_execution_role_policy will be created
+ resource "aws_iam_role_policy_attachment" "crawlinghub_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "crawlinghub-prod-ecs-execution-role"
    }

  # aws_security_group.crawlinghub will be created
+ resource "aws_security_group" "crawlinghub" {
      + arn                    = (known after apply)
      + description            = "Security group for crawlinghub web API tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "crawlinghub-prod-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all               = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.crawlinghub_alb will be created
+ resource "aws_security_group" "crawlinghub_alb" {
      + arn                    = (known after apply)
      + description            = "Security group for CrawlingHub ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from internet (redirect to HTTPS)"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "crawlinghub-prod-alb-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod-alb"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all               = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod-alb"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.scheduler will be created
+ resource "aws_security_group" "scheduler" {
      + arn                    = (known after apply)
      + description            = "Security group for crawlinghub scheduler tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "crawlinghub-prod-scheduler-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod-scheduler"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all               = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod-scheduler"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.sqs_listener will be created
+ resource "aws_security_group" "sqs_listener" {
      + arn                    = (known after apply)
      + description            = "Security group for crawlinghub SQS listener tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "crawlinghub-prod-sqs-listener-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod-sqs-listener"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all               = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-crawlinghub-prod-sqs-listener"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_ssm_parameter.alb_dns_name will be created
+ resource "aws_ssm_parameter" "alb_dns_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ALB DNS name for crawlinghub"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/services/crawlinghub/alb-dns-name"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.crawlinghub_alb.aws_lb.this will be created
+ resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "crawlinghub-prod-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (sensitive value)
      + tags                                                         = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Application Load Balancer crawlinghub-prod-alb"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-alb"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                                                     = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Application Load Balancer crawlinghub-prod-alb"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-alb"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.crawlinghub_alb.aws_lb_listener.http["default"] will be created
+ resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTP listener for crawlinghub-prod-alb"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-alb-http-default"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                                                              = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "HTTP listener for crawlinghub-prod-alb"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-alb-http-default"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.crawlinghub_alb.aws_lb_target_group.this["crawlinghub"] will be created
+ resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "crawlinghub-prod-alb-crawlinghub"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Target group for crawlinghub-prod-alb - crawlinghub"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-alb-crawlinghub"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                           = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Target group for crawlinghub-prod-alb - crawlinghub"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-prod-alb-crawlinghub"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive value)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200-299"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.crawlinghub_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/46ee44d3-866f-4029-b456-338f482eb1cb"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/crawlinghub-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/crawlinghub-prod"
          + "Owner"         = "windsurf@ryuqqq.com"
          + "Project"       = "crawlinghub"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub"
          + "Team"          = "engineering"
        }
      + tags_all          = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/crawlinghub-prod"
          + "Owner"         = "windsurf@ryuqqq.com"
          + "Project"       = "crawlinghub"
          + "Repository"    = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub"
          + "Team"          = "engineering"
        }
    }

  # module.crawlinghub_service.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.crawlinghub_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.crawlinghub_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "crawlinghub"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for crawlinghub"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for crawlinghub"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "crawlinghub"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive value)
        }
    }

  # module.crawlinghub_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "crawlinghub"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for crawlinghub"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for crawlinghub"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.scheduler_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/46ee44d3-866f-4029-b456-338f482eb1cb"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/crawlinghub-prod-scheduler"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/crawlinghub-prod-scheduler"
          + "Owner"         = "windsurf@ryuqqq.com"
          + "Project"       = "crawlinghub"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-scheduler"
          + "Team"          = "engineering"
        }
      + tags_all          = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/crawlinghub-prod-scheduler"
          + "Owner"         = "windsurf@ryuqqq.com"
          + "Project"       = "crawlinghub"
          + "Repository"    = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-scheduler"
          + "Team"          = "engineering"
        }
    }

  # module.scheduler_service.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.scheduler_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.scheduler_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "crawlinghub-scheduler"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for crawlinghub-scheduler"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for crawlinghub-scheduler"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive value)
        }
    }

  # module.scheduler_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "crawlinghub-scheduler"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for crawlinghub-scheduler"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for crawlinghub-scheduler"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.sqs_listener_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/46ee44d3-866f-4029-b456-338f482eb1cb"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/crawlinghub-prod-sqs-listener"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/crawlinghub-prod-sqs-listener"
          + "Owner"         = "windsurf@ryuqqq.com"
          + "Project"       = "crawlinghub"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-sqs-listener"
          + "Team"          = "engineering"
        }
      + tags_all          = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/crawlinghub-prod-sqs-listener"
          + "Owner"         = "windsurf@ryuqqq.com"
          + "Project"       = "crawlinghub"
          + "Repository"    = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "crawlinghub-sqs-listener"
          + "Team"          = "engineering"
        }
    }

  # module.sqs_listener_service.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.sqs_listener_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.sqs_listener_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "crawlinghub-sqs-listener"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for crawlinghub-sqs-listener"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-listener"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for crawlinghub-sqs-listener"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-listener"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive value)
        }
    }

  # module.sqs_listener_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "crawlinghub-sqs-listener"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for crawlinghub-sqs-listener"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-listener"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for crawlinghub-sqs-listener"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-sqs-listener"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "crawlinghub"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ alb_arn                        = (known after apply)
+ alb_dns_name                   = (known after apply)
+ alb_security_group_id          = (known after apply)
+ ecs_cluster_arn                = (known after apply)
+ ecs_cluster_id                 = (known after apply)
+ ecs_cluster_name               = "crawlinghub-prod-cluster"
+ scheduler_log_group_name       = "/aws/ecs/crawlinghub-prod-scheduler"
+ scheduler_security_group_id    = (known after apply)
+ scheduler_service_id           = (known after apply)
+ scheduler_service_name         = "crawlinghub-scheduler"
+ sqs_listener_log_group_name    = "/aws/ecs/crawlinghub-prod-sqs-listener"
+ sqs_listener_security_group_id = (known after apply)
+ sqs_listener_service_id        = (known after apply)
+ sqs_listener_service_name      = "crawlinghub-sqs-listener"
+ target_group_arn               = (known after apply)
+ web_api_log_group_arn          = (known after apply)
+ web_api_log_group_name         = "/aws/ecs/crawlinghub-prod"
+ web_api_security_group_id      = (known after apply)
+ web_api_service_id             = (known after apply)
+ web_api_service_name           = "crawlinghub"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/ecs-service
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-service%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/ecs-service
  ```
Plan: 26 to add, 0 to change, 0 to destroy.

---
### 3. dir: `terraform/elasticache-redis` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.private_subnet_ids: Reading...
data.aws_ssm_parameter.private_subnet_ids: Read complete after 0s [id=/shared/network/private-subnet-ids]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.redis_engine will be created
+ resource "aws_cloudwatch_log_group" "redis_engine" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/elasticache/crawlinghub-redis-prod/engine-log"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"   = "cloudwatch-logs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "log-crawlinghub-redis-prod-engine"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all          = {
          + "Component"   = "cloudwatch-logs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "log-crawlinghub-redis-prod-engine"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
    }

  # aws_cloudwatch_log_group.redis_slow will be created
+ resource "aws_cloudwatch_log_group" "redis_slow" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/elasticache/crawlinghub-redis-prod/slow-log"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"   = "cloudwatch-logs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "log-crawlinghub-redis-prod-slow"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all          = {
          + "Component"   = "cloudwatch-logs"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "log-crawlinghub-redis-prod-slow"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
    }

  # aws_cloudwatch_metric_alarm.cpu_utilization will be created
+ resource "aws_cloudwatch_metric_alarm" "cpu_utilization" {
      + actions_enabled                       = true
      + alarm_description                     = "Redis CPU utilization is too high"
      + alarm_name                            = "crawlinghub-redis-prod-cpu-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.